"""
1.什么是序列
内容连续、有序、支持下标索引的一类数据容器
2.哪些数据容器可以视为序列
列表、元组、字符串
3.序列如何做切片
序列[起始:结束:步长]
    起始可以省略，省略从头开始
    结束可以省略，省略到尾结束
    步长可以省略，省略步长为1(可以为负数，表示倒叙执行)
"""

# 对list进行切片，从1开始，4结束，步长1
my_list = [0, 1, 2, 3, 4, 5, 6]
result1 = my_list[1:4]  # 步长默认是1，所以可以省略不写
print(f"结果1：{result1}")

# 对tuple进行切片，从头开始，到最后结束，步长1
my_tuple = (0, 1, 2, 3, 4, 5, 6)
result2 = my_tuple[:]  # 起始和结束不写表示从头到尾，步长为1可以省略
print(f"结果2：{result2}")

# 对str进行切片，从头开始，到最后结束，步长2
my_str = "01234567"
result3 = my_str[::2]
print(f"结果3：{result3}")

# 对str进行切片，从头开始到最后结束，步长-1
my_str = "01234567"
result4 = my_str[::-1]  # 等同于将序列反转了
print(f"结果4：{result4}")

# 对列表进行切片，从3开始，到1结束，步长-1
my_list = [0, 1, 2, 3, 4, 5, 6]
result5 = my_list[3:1:-1]
print(f"结果4：{result5}")

# 对元组进行切片，从头开始，到尾结束，步长-2
my_tuple = (0, 1, 2, 3, 4, 5, 6)
result6 = my_tuple[::-2]
print(f"结果4：{result6}")

"""
练习案例：序列的切片实践
有字符串："万过月薪，员序程马黑来，nohtyP学"
请使用学过的任何方式，得到"黑马程序员"
"""
my_old_str = "万过薪月，员序程马黑来，nohtyP学"
# 方法1
my_new_str1 = my_old_str[::-1][9:14]
print(my_new_str1)
# 方法2
result3 = my_old_str.split("，")[1].replace("来","")[::-1]